IDENTIFICATION DIVISION.
PROGRAM-ID. MoveCorrespondingExample.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-GROUP1.
   05 WS-NUM1   PIC 9(5) VALUE 12345.
   05 WS-NUM2   PIC 9(5) VALUE 54321.
   05 WS-TEXT   PIC X(10) VALUE 'GROUP1'.
   
01 WS-GROUP2.
   05 WS-NUM1   PIC 9(5).
   05 WS-NUM2   PIC 9(5).
   05 WS-TEXT   PIC X(10).

PROCEDURE DIVISION.
    MOVE CORRESPONDING WS-GROUP1 TO WS-GROUP2.
    
    DISPLAY 'WS-GROUP2-WS-NUM1: ' WS-NUM1 OF WS-GROUP2.
    DISPLAY 'WS-GROUP2-WS-NUM2: ' WS-NUM2 OF WS-GROUP2.
    DISPLAY 'WS-GROUP2-WS-TEXT: ' WS-TEXT OF WS-GROUP2.
    
    STOP RUN.
