IDENTIFICATION DIVISION.
PROGRAM-ID. MoveAllExample.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-STRING1  PIC X(10).
01 WS-STRING2  PIC X(10).

PROCEDURE DIVISION.
    MOVE ALL 'X' TO WS-STRING1, WS-STRING2.
    
    DISPLAY 'WS-STRING1: ' WS-STRING1.
    DISPLAY 'WS-STRING2: ' WS-STRING2.
    
    STOP RUN.
