000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ABC123_A.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 A   PIC 9(3).
000600 01 E   PIC 9(3).
000700 01 K   PIC 9(3).
000800 PROCEDURE DIVISION.
000900 MAIN.
001000     ACCEPT A FROM CONSOLE
001100     ACCEPT E FROM CONSOLE
001200     ACCEPT E FROM CONSOLE
001300     ACCEPT E FROM CONSOLE
001400     ACCEPT E FROM CONSOLE
001500     ACCEPT K FROM CONSOLE
001600     SUBTRACT A FROM E
001700     IF E IS NOT GREATER THAN K
001800           DISPLAY 'Yay!' UPON CONSOLE
001900     ELSE
002000           DISPLAY ':(' UPON CONSOLE
002100     END-IF
002200     STOP RUN.
