       IDENTIFICATION DIVISION.
       PROGRAM-ID. EVAL-EX5.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CONDITION PIC X VALUE 'T'.

       PROCEDURE DIVISION.
       EVALUATE CONDITION
           WHEN 'T'
               DISPLAY "CONDITION IS TRUE"
           WHEN 'F'
               DISPLAY "CONDITION IS FALSE"
       END-EVALUATE.
       STOP RUN.
