       IDENTIFICATION DIVISION.
       PROGRAM-ID. EVAL-EX4.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC 9 VALUE 4.
       01 Y PIC 9 VALUE 6.

       PROCEDURE DIVISION.
       EVALUATE X + Y
           WHEN 10
               DISPLAY "THE SUM OF X AND Y IS 10"
           WHEN 20
               DISPLAY "THE SUM OF X AND Y IS 20"
           WHEN OTHER
               DISPLAY "THE SUM IS NEITHER 10 NOR 20"
       END-EVALUATE.
       STOP RUN.
