IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ln         PIC X(30).
01 A          PIC 9(10).
01 B          PIC 9(10).
01 ans        PIC 9(10).
01 zs         PIC X(10).

PROCEDURE DIVISION.
  ACCEPT ln.
  UNSTRING ln DELIMITED BY SPACE INTO A B.
  IF A <= 9 AND B <= 9
    MULTIPLY A BY B GIVING ans
    MOVE ans TO zs
    DISPLAY zs
  ELSE
    DISPLAY -1
  END-IF.
  STOP RUN.
