      IDENTIFICATION DIVISION.
      PROGRAM-ID. 081A.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 INP.
      	03 S1 PIC 9(1).
      	03 S2 PIC 9(1).
      	03 S3 PIC 9(1).
      01 ANS PIC 9(1).
      
      PROCEDURE DIVISION.
      ACCEPT INP.
      COMPUTE ANS = S1 + S2 + S3
      DISPLAY ANS.
      STOP RUN.