PROGRAM-ID. MyProgram.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-STRING       PIC X(20) VALUE 'OHELLO COBooOOOL WORLDO'.
01 WS-COUNT        PIC 9(2).

PROCEDURE DIVISION.
   INSPECT WS-STRING TALLYING WS-COUNT FOR ALL 'O'.
   DISPLAY "Number of 'O's in the string: " WS-COUNT.
   STOP RUN.
