 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST090.

 DATA DIVISION.
 WORKING-STORAGE SECTION.

 01 INP     PIC X(3).
 01 C1.
  03 C11    PIC X(1).
  03 FILLER PIC X(2).
 01 C2.
  03 FILLER PIC X(1).
  03 C22    PIC X(1).
  03 FILLER PIC X(1).
 01 C3.
  03 FILLER PIC X(2).
  03 C33    PIC X(1).
 01 ANS.
  03 A1    PIC X(1).
  03 A2    PIC X(1).
  03 A3    PIC X(1).

 PROCEDURE DIVISION.

  ACCEPT INP.
  UNSTRING INP DELIMITED BY ALL ' '
      INTO C1.

  ACCEPT INP.
  UNSTRING INP DELIMITED BY ALL ' '
      INTO C2.

  ACCEPT INP.
  UNSTRING INP DELIMITED BY ALL ' '
      INTO C3.

  MOVE C11 TO A1.
  MOVE C22 TO A2.
  MOVE C33 TO A3.

 DISPLAY ANS.

 STOP RUN.