IDENTIFICATION DIVISION.
PROGRAM-ID. 166A.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 S          PIC X(3).
*>
PROCEDURE DIVISION.
  ACCEPT S.
*>
  IF (S = 'ABC')
    DISPLAY 'ARC'
  ELSE
    DISPLAY 'ABC'
  END-IF.
*>
  STOP RUN.
