IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S              PIC X(3).

PROCEDURE DIVISION.
  ACCEPT S.
  IF "ARC" = S
      DISPLAY "ABC"
  ELSE
      DISPLAY "ARC"
  END-IF.
  STOP RUN.
