IDENTIFICATION DIVISION.
PROGRAM-ID. PROGRAM_ID.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 a          PIC X(1).

PROCEDURE DIVISION.
  ACCEPT a.
  IF a <= "Z"
    DISPLAY "A"
  ELSE
    DISPLAY "a"
  END-IF.
  STOP RUN.
