 IDENTIFICATION DIVISION.
 PROGRAM-ID.     TEST121.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 INP        PIC X(10).
  01 H1         PIC 9(2).
  01 W1         PIC 9(2).
  01 H2         PIC 9(2).
  01 W2         PIC 9(2).
  01 WANS       PIC 9(4).
  01 ANS        PIC X(4).

 PROCEDURE DIVISION.
  ACCEPT INP.
  UNSTRING INP DELIMITED BY ALL ' '
      INTO H1 W1.

  ACCEPT INP.
  UNSTRING INP DELIMITED BY ALL ' '
      INTO H2 W2.

  COMPUTE WANS = (H1 - H2) * (W1 - W2).
  MOVE WANS        TO ANS.
  DISPLAY ANS.
 STOP RUN.