   IDENTIFICATION DIVISION.
   PROGRAM-ID. MultiRoundedExample.
   DATA DIVISION.
   WORKING-STORAGE SECTION.
   01  NUM1          PIC 99V99 VALUE 15.55.
   01  NUM2          PIC 99V99 VALUE 10.49.
   01  RESULT        PIC 999V99.

   PROCEDURE DIVISION.
   BEGIN.
       MULTIPLY NUM1 BY NUM2 GIVING RESULT NUM1 ROUNDED.
       DISPLAY 'NUM1: ' NUM1.
       DISPLAY 'NUM2: ' NUM2.
       DISPLAY 'Result of multiplication (rounded): ' RESULT.
       STOP RUN.
