IDENTIFICATION DIVISION.
PROGRAM-ID. 164B.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INP        PIC X(20).
01 A          PIC 9(3).
01 B          PIC 9(3).
01 C          PIC 9(3).
01 D          PIC 9(3).
01 K1         PIC 9(3).
01 K2         PIC 9(3).
*>
PROCEDURE DIVISION.
  ACCEPT INP.
  UNSTRING INP DELIMITED BY ' '
      INTO A B C D.
*>
  COMPUTE K1 = (A + D - 1) / D.
  COMPUTE K2 = (C + B - 1) / B.
*>
  IF (K1 >= K2)
    DISPLAY 'Yes'
  ELSE
    DISPLAY 'No'
  END-IF. 
*>
  STOP RUN.
