 IDENTIFICATION DIVISION.
 PROGRAM-ID. TEST134.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
  01 INP   PIC 9(3).
  01 ANS   PIC X(7).

 PROCEDURE DIVISION.
  ACCEPT INP.
  COMPUTE ANS = 3 * INP * INP.
  DISPLAY ANS.

 STOP RUN. 