IDENTIFICATION DIVISION.
PROGRAM-ID. A-Birthday.
 
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INP      PIC X(100).
01 IN-A     PIC 9(2).
01 IN-B     PIC 9(2).
 
PROCEDURE DIVISION.
MAIN-001.
  ACCEPT INP.
  UNSTRING INP DELIMITED BY ALL ' '
      INTO IN-A IN-B.

  IF (IN-A <= 8) AND (IN-B <= 8)
    DISPLAY 'Yay!'
  ELSE 
    DISPLAY ':('
  END-IF.
 
MAIN-EXIT.
  STOP RUN.