      IDENTIFICATION DIVISION.
      PROGRAM-ID. 149A.
      DATA DIVISION.
      WORKING-STORAGE SECTION.
      01 INP PIC X(300).
      01 S 	 PIC X(100).
      01 T   PIC X(100).
      01 OUT PIC X(200).
      
      PROCEDURE DIVISION.
      ACCEPT INP.

      UNSTRING INP DELIMITED BY " "
      INTO S T.

      STRING T S DELIMITED BY " "
      INTO OUT.

      DISPLAY OUT.
      
      STOP RUN.
