IDENTIFICATION DIVISION. 
PROGRAM-ID. AcceptDayExample. 
DATA DIVISION. 
WORKING-STORAGE SECTION. 
01  WS-Day    PIC 9(7). 
PROCEDURE DIVISION. 
ACCEPT WS-Day FROM DAY. 
DISPLAY "Accepted Day: " WS-Day. 
STOP RUN. 
