IDENTIFICATION DIVISION. 
PROGRAM-ID. AcceptTimeExample. 
DATA DIVISION. 
WORKING-STORAGE SECTION. 
01  WS-Time    PIC 9(6). 
PROCEDURE DIVISION. 
ACCEPT WS-Time FROM TIME. 
DISPLAY "Accepted Time: " WS-Time. 
STOP RUN. 
