IDENTIFICATION DIVISION. 
PROGRAM-ID. AcceptDateYYYYMMDD. 
DATA DIVISION. 
WORKING-STORAGE SECTION. 
01  WS-Date    PIC 9(8). 
PROCEDURE DIVISION. 
ACCEPT WS-Date FROM DATE YYYYMMDD. 
DISPLAY "Accepted Date (YYYYMMDD): " WS-Date. 
STOP RUN. 
