IDENTIFICATION DIVISION. 
PROGRAM-ID. AcceptDayYYYYDDD. 
DATA DIVISION. 
WORKING-STORAGE SECTION. 
01  WS-Day    PIC 9(7). 
PROCEDURE DIVISION. 
ACCEPT WS-Day FROM DAY YYYYDDD. 
DISPLAY "Accepted Day (YYYYDDD): " WS-Day. 
STOP RUN. 
