IDENTIFICATION DIVISION. 
PROGRAM-ID. AcceptTodaysDateMMDD. 
DATA DIVISION. 
WORKING-STORAGE SECTION. 
01  WS-TodaysDate    PIC 9(8). 
PROCEDURE DIVISION. 
ACCEPT WS-TodaysDate FROM TODAYS_DATE MMDDYYYY. 
DISPLAY "Accepted Today's Date (MMDDYYYY): " WS-TodaysDate. 
STOP RUN. 
