IDENTIFICATION DIVISION.
PROGRAM-ID. GoToSimple.

PROCEDURE DIVISION.
    GO TO procedureName.
    STOP RUN.

procedureName.
    DISPLAY 'Executing procedureName'.
    STOP RUN.
